data/sysbench/ext4/rndwr/150G/nvme0n1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     86706.11
    fsyncs/s:                     86706.11

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1354.78

General statistics:
    total time:                          60.0003s
    total number of events:              5202689

Latency (ms):
         min:                                  0.03
         avg:                                  0.21
         max:                                  4.52
         95th percentile:                      0.45
         sum:                            1077096.69

Threads fairness:
    events (avg/stddev):           260134.4500/59018.87
    execution time (avg/stddev):   53.8548/11.51