data/sysbench/ext4/rndwr/150G/nvme0n1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     98396.77
    fsyncs/s:                     98396.77

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1537.45

General statistics:
    total time:                          60.0004s
    total number of events:              5904219

Latency (ms):
         min:                                  0.03
         avg:                                  0.33
         max:                                 18.69
         95th percentile:                      0.78
         sum:                            1934384.96

Threads fairness:
    events (avg/stddev):           147605.4750/57047.54
    execution time (avg/stddev):   48.3596/17.24