data/sysbench/ext4/rndwr/150G/nvme0n1thread50
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     109556.33
    fsyncs/s:                     109556.33

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1711.82

General statistics:
    total time:                          60.0006s
    total number of events:              6573852

Latency (ms):
         min:                                  0.03
         avg:                                  0.42
         max:                                 17.81
         95th percentile:                      0.95
         sum:                            2731012.73

Threads fairness:
    events (avg/stddev):           131477.0400/30025.41
    execution time (avg/stddev):   54.6203/11.97